/**
 * Глобальное состояние (State) приложения Coffee-House.
 * Хранит доменные данные в оперативной памяти в течение сессии.
 */
export const store = {
    /**
     * Массив всех нормализованных продуктов (экземпляров класса Product).
     * @type {Product[]}
     */
    products: [],

    /**
     * Список товаров, добавленных пользователем в корзину.
     * @type {Array}
     */
    cart: [],

    /**
     * Продукт, который в данный момент открыт пользователем в модальном окне заказа.
     * Если модальное окно закрыто, равен null.
     * @type {Product|null}
     */
    currentProduct: null
};